In [3]:
# Importing all the dependencies
import pandas as pd
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import roc_auc_score
from sklearn.preprocessing import StandardScaler, OneHotEncoder

In [4]:
train_data = pd.read_csv('train.csv')
test_data = pd.read_csv('test.csv')
sample = pd.read_csv('sample_submission.csv')

In [5]:
train_data

,id,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,0,15674932,Okwudilichukwu,668,France,Male,33.0,3,0.00,2,1.0,0.0,181449.97,0
1,1,15749177,Okwudiliolisa,627,France,Male,33.0,1,0.00,2,1.0,1.0,49503.50,0
2,2,15694510,Hsueh,678,France,Male,40.0,10,0.00,2,1.0,0.0,184866.69,0
3,3,15741417,Kao,581,France,Male,34.0,2,148882.54,1,1.0,1.0,84560.88,0
4,4,15766172,Chiemenam,716,Spain,Male,33.0,5,0.00,2,1.0,1.0,15068.83,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
165029,165029,15667085,Meng,667,Spain,Female,33.0,2,0.00,1,1.0,1.0,131834.75,0
165030,165030,15665521,Okechukwu,792,France,Male,35.0,3,0.00,1,0.0,0.0,131834.45,0
165031,165031,15664752,Hsia,565,France,Male,31.0,5,0.00,1,1.0,1.0,127429.56,0
165032,165032,15689614,Hsiung,554,Spain,Female,30.0,7,161533.00,1,0.0,1.0,71173.03,0
165033,165033,15732798,Ulyanov,850,France,Male,31.0,1,0.00,1,1.0,0.0,61581.79,1

In [6]:
train_data['Exited'].unique()

array([0, 1])

In [7]:
sample

            id  Exited
0       165034     0.5
1       165035     0.5
2       165036     0.5
3       165037     0.5
4       165038     0.5
...        ...     ...
110018  275052     0.5
110019  275053     0.5
110020  275054     0.5
110021  275055     0.5
110022  275056     0.5

[110023 rows x 2 columns]

In [8]:
# Remove CustomerID and Surname as it does not add value to our data
for ds in [train_data, test_data]:
    ds.drop(['CustomerId', 'Surname', "Gender"], axis=1, inplace=True)

In [9]:
train_data

,id,CreditScore,Geography,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,0,668,France,33.0,3,0.00,2,1.0,0.0,181449.97,0
1,1,627,France,33.0,1,0.00,2,1.0,1.0,49503.50,0
2,2,678,France,40.0,10,0.00,2,1.0,0.0,184866.69,0
3,3,581,France,34.0,2,148882.54,1,1.0,1.0,84560.88,0
4,4,716,Spain,33.0,5,0.00,2,1.0,1.0,15068.83,0
...,...,...,...,...,...,...,...,...,...,...,...
165029,165029,667,Spain,33.0,2,0.00,1,1.0,1.0,131834.75,0
165030,165030,792,France,35.0,3,0.00,1,0.0,0.0,131834.45,0
165031,165031,565,France,31.0,5,0.00,1,1.0,1.0,127429.56,0
165032,165032,554,Spain,30.0,7,161533.00,1,0.0,1.0,71173.03,0
165033,165033,850,France,31.0,1,0.00,1,1.0,0.0,61581.79,1

In [ ]:
# Converting Geography column into a quantitative value using One-Hot encoding
encoder = OneHotEncoder(sparse=False, drop='First')
encoded_data = encoder.fit_transform(t)